# ---------------------------------------------------------------------------- #
#                             Задачи върху списъци                             #
# ---------------------------------------------------------------------------- #

# --------------------------------- Задача 1. -------------------------------- #
# Напишете програма, която чете цели числа въведени от потребителя и ги
# съхранява в списък. Програма трябва да продължи да чете стойности, докато
# потребителят не въведе 0. След това тя трябва да покаже всички стойности, въведени от
# потребителя (с изключение на 0), подредени от най-малката до най-голямата стойност.
# Пример:
#     вход: 2,3,1,6,5,4,2,0
#     изход:1,2,2,3,4,5,6,

# YOUR CODE HERE
# input_numbers = []

# while True:
#     num = int(input('Enter number: '))
#     if num==0:
#         break
#     input_numbers.append(num)

# for num in sorted(input_numbers):
#     print(num, end=',')


# --------------------------------- Задача 2. -------------------------------- #
# Да се създаде програма, която чете думи като вход от клавиатурата, докато
# потребителят не въведе празен ред. След като потребителят въведе празен ред,
# програмата трябва да изведе всяка дума, въведена от потребителя точно веднъж.
# Думите трябва да се показват в същия ред, в който са били въведени.
# Пример:
#   вход: first; second; first; third; second
#   изход:first; second; third

# YOUR CODE HERE
# words = []

# while True:
#     user_input=input('Enter word: ')
#     if user_input=='':
#         break
#     if user_input not in words:
#         words.append(user_input)

# print(words)


# --------------------------------- Задача 3. -------------------------------- #
# Да се създаде програма, която да чете цели числа въведени от потребителя,
# докато не бъде въведен празен ред. След като всичките числа са прочетени, програмата
# трябва да показва всички отрицателни числа, последвани от нули, последвани от всички
# положителни числа. Във всяка група номерата трябва да се показват в същия ред, в
# който са въведени от потребителя.
# Пример:
#   вход:   3, -4, 1, 0, -1, 0, -2
#   изход: -4, -1, -2, 0, 0, 3, 1

# YOUR CODE HERE
# negatives = []
# positive = []
# zeros = []

# while True:
#     user_input = input('Enter number: ')
#     if user_input=='':
#         break

#     num = int(user_input)
#     if num<0:
#         negatives.append(num)
#     elif num==0:
#         zeros.append(num)
#     else:
#         positive.append(num)

# output = negatives+zeros+positive
# print(output)


# --------------------------------- Задача 4. -------------------------------- #
# Напишете програма на Python, която намира най-дългата последователност от
# еднакви елементи в списък. Ако има няколко такива редици с еднаква дължина,
# върнете първата срещната.
# Пример:
#     вход: numbers=[2, 1, 1, 2, 3, 3, 2, 2, 2],          изход:  [2, 2, 2]
#     вход: numbers=[4, 4, 2, 2, 2, 3, 3, 1, 4, 4, 4],    изход:  [2, 2, 2]

# YOUR CODE HERE
# numbers = [2, 1, 1, 2, 3, 3, 2, 2, 2]
# sequence = []
# max_sequence = []

# numbers.append(None)

# for num in numbers:
#     if not sequence or num == sequence[-1]:
#         sequence.append(num)
#     else:
#         if len(sequence) > len(max_sequence):
#             max_sequence = sequence.copy()
#         sequence = [num]


# print(max_sequence)


# --------------------------------- Задача 5. -------------------------------- #
# Напишете програма, която създава следната квадратна матрица m(n*n), по
# зададен от потребителя размер (n).
# Пример:
#     вход: n=3
#     изход:
#         [1, 4, 7]
#         [2, 5, 8]
#         [3, 6, 9]

#     вход: n=4
#     изход:
#         [1, 5, 9, 13]
#         [2, 6, 10, 14]
#         [3, 7, 11, 15]
#         [4, 8, 12, 16]

# YOUR CODE HERE
# n = 3
# m=[]

# for i in range(1,n+1):
#     row=[i]
#     for j in range(1,n):
#         row.append(i+j*n)
#     m.append(row)

# for row in m:
#     print(row)


# --------------------------------- Задача 6. -------------------------------- #
# Напишете програма, която създава следната квадратна матрица (n*n), по
# зададен от потребителя размер (n).
# Пример:
#     вход: n=3
#     изход:
#         [1, 6, 7]
#         [2, 5, 8]
#         [3, 4, 9]

#     вход: n=4
#     изход:
#         [1, 8, 9, 16]
#         [2, 7, 10, 15]
#         [3, 6, 11, 14]
#         [4, 5, 12, 13]

# YOUR CODE HERE
# n=4
# m=[]

# for i in range(1,n+1):
#     row=[i]
#     for j in range(2,n+1):
#         if j%2==0:
#             row.append((j*n)-(i-1))
#         else:
#             row.append(row[0]+(j-1)*n)
#     m.append(row)

# for row in m:
#     print(row)

# --------------------------------- Задача 7. -------------------------------- #
# Напишете програма, която намира всички последователности от поне два еднакви
# елемента в списък и ги показва. Редът на показването няма значение.

# Пример:
#     вход: numbers=[2, 1, 1, 2, 3, 3, 2, 2, 2, 1],
#     изход:
#           [1,1]
#           [3,3]
#           [2,2,2]

#     вход: numbers=[4, 4, 2, 2, 2, 3, 3, 1, 4, 4, 4],
#     изход:
#          [4, 4]
#          [2, 2, 2]
#          [3, 3]
#          [4, 4, 4]


# YOUR CODE HERE
# numbers = [4, 4, 2, 2, 2, 3, 3, 1, 4, 4, 4]
# sequences = []
# current_sequence = []

# numbers.append(None)

# for num in numbers:
#     if not current_sequence or num == current_sequence[0]:
#         current_sequence.append(num)
#     else:
#         # We've found the end of a sequence
#         if len(current_sequence) > 1:
#             sequences.append(current_sequence.copy())
#         current_sequence = [num]


# for s in sequences:
#     print(s)
